MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV11Z128VLC7/mcu.h
/*
** ###################################################################
**     Processors:          MKV11Z128VFM7
**                          MKV11Z128VLC7
**                          MKV11Z128VLF7
**                          MKV11Z128VLH7
**                          MKV11Z64VFM7
**                          MKV11Z64VLC7
**                          MKV11Z64VLF7
**                          MKV11Z64VLH7
**
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          MCUXpresso Compiler
**
**     Reference manual:    KV11P64M75RM Rev.2, April 2015
**     Version:             rev. 1.1, 2017-03-22
**     Build:               b180801
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MKV11Z7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2018 NXP
**
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2014-12-14)
**         Initial version.
**     - rev. 1.1 (2017-03-22)
**         Corrected missing CAN0Rx DMA request.
**
** ###################################################################
*/

/*!
 * @file MKV11Z7.h
 * @version 1.1
 * @date 2017-03-22
 * @brief CMSIS Peripheral Access Layer for MKV11Z7
 *
 * CMSIS Peripheral Access Layer for MKV11Z7
 */

#ifndef _MKV11Z7_H_
#define _MKV11Z7_H_                              /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0001U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 48                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M0 SV Hard Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M0 SV Call Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M0 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M0 System Tick Interrupt */

  /* Device specific interrupts */
  DMA0_DMA4_IRQn               = 0,                /**< DMA channel 0 and 4 transfer complete */
  DMA1_DMA5_IRQn               = 1,                /**< DMA channel 1 and 5 transfer complete */
  DMA2_DMA6_IRQn               = 2,                /**< DMA channel 2 and 6 transfer complete */
  DMA3_DMA7_IRQn               = 3,                /**< DMA channel 2 and 7 transfer complete */
  DMA_Error_IRQn               = 4,                /**< DMA error interrupt channels 0-7 */
  FTFA_IRQn                    = 5,                /**< FTFA command complete and read collision */
  LVD_LVW_IRQn                 = 6,                /**< Low-voltage detect, low-voltage warning */
  LLWU_IRQn                    = 7,                /**< Low Leakage Wakeup */
  I2C0_IRQn                    = 8,                /**< I2C0 interrupt */
  Reserved25_IRQn              = 9,                /**< Reserved interrupt */
  SPI0_IRQn                    = 10,               /**< SPI0 single interrupt vector for all sources */
  Reserved27_IRQn              = 11,               /**< Reserved interrupt */
  UART0_IRQn                   = 12,               /**< UART0 status and error */
  UART1_IRQn                   = 13,               /**< UART1 status and error */
  CAN0_IRQn                    = 14,               /**< CAN0 interrupt */
  ADC0_IRQn                    = 15,               /**< ADC0 interrupt */
  ADC1_IRQn                    = 16,               /**< ADC1 interrupt */
  FTM0_IRQn                    = 17,               /**< FTM0 single interrupt vector for all sources */
  FTM1_IRQn                    = 18,               /**< FTM1 single interrupt vector for all sources */
  FTM2_IRQn                    = 19,               /**< FTM2 single interrupt vector for all sources */
  CMP0_IRQn                    = 20,               /**< CMP0 interrupt */
  CMP1_IRQn                    = 21,               /**< CMP1 interrupt */
  FTM3_IRQn                    = 22,               /**< FTM3 single interrupt vector for all sources */
  WDOG_EWM_IRQn                = 23,               /**< Single interrupt vector for  WDOG and EWM */
  FTM4_IRQn                    = 24,               /**< FTM4 single interrupt vector for all sources */
  DAC0_IRQn                    = 25,               /**< DAC0 interrupt */
  FTM5_IRQn                    = 26,               /**< FTM5 single interrupt vector for all sources */
  MCG_IRQn                     = 27,               /**< MCG interrupt */
  LPTMR0_IRQn                  = 28,               /**< LPTMR0 interrupt */
  PDB0_PDB1_IRQn               = 29,               /**< Single interrupt vector for  PDB0 and PDB1 */
  PORTA_IRQn                   = 30,               /**< PORTA pin detect */
  PORTB_PORTC_PORTD_PORTE_IRQn = 31                /**< Single interrupt vector for PORTB, PORTC, PORTD and PORTE pin detect */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M0 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M0 Core Configuration
 * @{
 */

