MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV11Z128VLC7/mcu.h
/*! @name SOPT5 - System Options Register 5 */
/*! @{ */
#define SIM_SOPT5_UART0TXSRC_MASK                (0x3U)
#define SIM_SOPT5_UART0TXSRC_SHIFT               (0U)
/*! UART0TXSRC - UART 0 Transmit Data Source Select
 *  0b00..UART0_TX pin
 *  0b01..UART0_TX pin modulated with FTM1 channel 0 output
 *  0b10..UART0_TX pin modulated with FTM2 channel 0 output
 *  0b11..Reserved
 */
#define SIM_SOPT5_UART0TXSRC(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT5_UART0TXSRC_SHIFT)) & SIM_SOPT5_UART0TXSRC_MASK)
#define SIM_SOPT5_UART0RXSRC_MASK                (0xCU)
#define SIM_SOPT5_UART0RXSRC_SHIFT               (2U)
/*! UART0RXSRC - UART 0 Receive Data Source Select
 *  0b00..UART0_RX pin
 *  0b01..CMP0
 *  0b10..CMP1
 *  0b11..Reserved
 */
#define SIM_SOPT5_UART0RXSRC(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT5_UART0RXSRC_SHIFT)) & SIM_SOPT5_UART0RXSRC_MASK)
#define SIM_SOPT5_UART1TXSRC_MASK                (0x30U)
#define SIM_SOPT5_UART1TXSRC_SHIFT               (4U)
/*! UART1TXSRC - UART 1 Transmit Data Source Select
 *  0b00..UART1_TX pin
 *  0b01..UART1_TX pin modulated with FTM1 channel 0 output
 *  0b10..UART1_TX pin modulated with FTM2 channel 0 output
 *  0b11..Reserved
 */
#define SIM_SOPT5_UART1TXSRC(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT5_UART1TXSRC_SHIFT)) & SIM_SOPT5_UART1TXSRC_MASK)
#define SIM_SOPT5_UART1RXSRC_MASK                (0xC0U)
#define SIM_SOPT5_UART1RXSRC_SHIFT               (6U)
/*! UART1RXSRC - UART 1 Receive Data Source Select
 *  0b00..UART1_RX pin
 *  0b01..CMP0
 *  0b10..CMP1
 *  0b11..Reserved
 */
#define SIM_SOPT5_UART1RXSRC(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT5_UART1RXSRC_SHIFT)) & SIM_SOPT5_UART1RXSRC_MASK)
#define SIM_SOPT5_UART0ODE_MASK                  (0x10000U)
#define SIM_SOPT5_UART0ODE_SHIFT                 (16U)
/*! UART0ODE - UART0 Open Drain Enable
 *  0b0..Open drain is disabled on UART0
 *  0b1..Open drain is enabled on UART0
 */
#define SIM_SOPT5_UART0ODE(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT5_UART0ODE_SHIFT)) & SIM_SOPT5_UART0ODE_MASK)
#define SIM_SOPT5_UART1ODE_MASK                  (0x20000U)
#define SIM_SOPT5_UART1ODE_SHIFT                 (17U)
/*! UART1ODE - UART1 Open Drain Enable
 *  0b0..Open drain is disabled on UART1
 *  0b1..Open drain is enabled on UART1
 */
#define SIM_SOPT5_UART1ODE(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT5_UART1ODE_SHIFT)) & SIM_SOPT5_UART1ODE_MASK)
/*! @} */

/*! @name SOPT6 - Systems Option Register 6 */
/*! @{ */
#define SIM_SOPT6_FTM3FLT0_MASK                  (0x1U)
#define SIM_SOPT6_FTM3FLT0_SHIFT                 (0U)
/*! FTM3FLT0 - FTM3 Fault 0 Select
 *  0b0..FTM3_FLT0 pin
 *  0b1..CMP0 out
 */
#define SIM_SOPT6_FTM3FLT0(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM3FLT0_SHIFT)) & SIM_SOPT6_FTM3FLT0_MASK)
#define SIM_SOPT6_FTM4FLT0_MASK                  (0x4U)
#define SIM_SOPT6_FTM4FLT0_SHIFT                 (2U)
/*! FTM4FLT0 - FTM4 Fault 0 Select
 *  0b0..FTM4_FLT0 pin
 *  0b1..CMP0 out
 */
#define SIM_SOPT6_FTM4FLT0(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM4FLT0_SHIFT)) & SIM_SOPT6_FTM4FLT0_MASK)
#define SIM_SOPT6_FTM5FLT0_MASK                  (0x8U)
#define SIM_SOPT6_FTM5FLT0_SHIFT                 (3U)
/*! FTM5FLT0 - FTM5 Fault 0 Select
 *  0b0..FTM5_FLT0 pin
 *  0b1..CMP0 out
 */
#define SIM_SOPT6_FTM5FLT0(x)                    (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM5FLT0_SHIFT)) & SIM_SOPT6_FTM5FLT0_MASK)
#define SIM_SOPT6_FTM3TRG0SRC_MASK               (0x80U)
#define SIM_SOPT6_FTM3TRG0SRC_SHIFT              (7U)
/*! FTM3TRG0SRC - FlexTimer 3 Hardware Trigger 0 Source Select
 *  0b0..CMP0 output drives FTM3 hardware trigger 0
 *  0b1..FTM5 channel match drives FTM3 hardware trigger 0
 */
#define SIM_SOPT6_FTM3TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM3TRG0SRC_SHIFT)) & SIM_SOPT6_FTM3TRG0SRC_MASK)
#define SIM_SOPT6_FTM3TRG1SRC_MASK               (0x100U)
#define SIM_SOPT6_FTM3TRG1SRC_SHIFT              (8U)
/*! FTM3TRG1SRC - FlexTimer 3 Hardware Trigger 1 Source Select
 *  0b0..PDB1 output drives FTM3 hardware trigger 1
 *  0b1..FTM4 channel match drives FTM3 hardware trigger 1
 */
#define SIM_SOPT6_FTM3TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM3TRG1SRC_SHIFT)) & SIM_SOPT6_FTM3TRG1SRC_MASK)
#define SIM_SOPT6_FTM3TRG2SRC_MASK               (0x200U)
#define SIM_SOPT6_FTM3TRG2SRC_SHIFT              (9U)
/*! FTM3TRG2SRC - FlexTimer 3 Hardware Trigger 2 Source Select
 *  0b0..CMP0 output drives FTM3 hardware trigger 2
 *  0b1..CMP1 output drives FTM3 hardware trigger 2
 */
#define SIM_SOPT6_FTM3TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM3TRG2SRC_SHIFT)) & SIM_SOPT6_FTM3TRG2SRC_MASK)
#define SIM_SOPT6_FTM4TRG0SRC_MASK               (0x400U)
#define SIM_SOPT6_FTM4TRG0SRC_SHIFT              (10U)
/*! FTM4TRG0SRC - FlexTimer 4 Hardware Trigger 0 Source Select
 *  0b0..CMP0 output drives FTM4 hardware trigger 0
 *  0b1..FTM3 channel match drives FTM4 hardware trigger 0
 */
#define SIM_SOPT6_FTM4TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM4TRG0SRC_SHIFT)) & SIM_SOPT6_FTM4TRG0SRC_MASK)
#define SIM_SOPT6_FTM4TRG1SRC_MASK               (0x800U)
#define SIM_SOPT6_FTM4TRG1SRC_SHIFT              (11U)
/*! FTM4TRG1SRC - FlexTimer 4 Hardware Trigger 1 Source Select
 *  0b0..PDB1 output trigger 1 drives FTM4 hardware trigger 1
 *  0b1..FTM5 channel match drives FTM4 hardware trigger 1
 */
#define SIM_SOPT6_FTM4TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM4TRG1SRC_SHIFT)) & SIM_SOPT6_FTM4TRG1SRC_MASK)
#define SIM_SOPT6_FTM4TRG2SRC_MASK               (0x1000U)
#define SIM_SOPT6_FTM4TRG2SRC_SHIFT              (12U)
/*! FTM4TRG2SRC - FlexTimer 4 Hardware Trigger 2 Source Select
 *  0b0..CMP0 output drives FTM4 hardware trigger 2
 *  0b1..CMP1 output drives FTM4 hardware trigger 2
 */
#define SIM_SOPT6_FTM4TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM4TRG2SRC_SHIFT)) & SIM_SOPT6_FTM4TRG2SRC_MASK)
#define SIM_SOPT6_FTM5TRG0SRC_MASK               (0x2000U)
#define SIM_SOPT6_FTM5TRG0SRC_SHIFT              (13U)
/*! FTM5TRG0SRC - FlexTimer 5 Hardware Trigger 0 Source Select
 *  0b0..CMP0 output drives FTM5 hardware trigger 0
 *  0b1..FTM3 channel match drives FTM5 hardware trigger 0
 */
#define SIM_SOPT6_FTM5TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM5TRG0SRC_SHIFT)) & SIM_SOPT6_FTM5TRG0SRC_MASK)
#define SIM_SOPT6_FTM5TRG1SRC_MASK               (0x4000U)
#define SIM_SOPT6_FTM5TRG1SRC_SHIFT              (14U)
/*! FTM5TRG1SRC - FlexTimer 5 Hardware Trigger 1 Source Select
 *  0b0..PDB1 output trigger 1 drives FTM5 hardware trigger 1
 *  0b1..FTM4 channel match drives FTM5 hardware trigger 1
 */
#define SIM_SOPT6_FTM5TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM5TRG1SRC_SHIFT)) & SIM_SOPT6_FTM5TRG1SRC_MASK)
#define SIM_SOPT6_FTM5TRG2SRC_MASK               (0x8000U)
#define SIM_SOPT6_FTM5TRG2SRC_SHIFT              (15U)
/*! FTM5TRG2SRC - FlexTimer 5 Hardware Trigger 2 Source Select
 *  0b0..CMP0 output drives FTM5 hardware trigger 2
 *  0b1..CMP1 output drives FTM5 hardware trigger 2
 */
#define SIM_SOPT6_FTM5TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM5TRG2SRC_SHIFT)) & SIM_SOPT6_FTM5TRG2SRC_MASK)
#define SIM_SOPT6_FTM4CH0SRC_MASK                (0xC0000U)
#define SIM_SOPT6_FTM4CH0SRC_SHIFT               (18U)
/*! FTM4CH0SRC - FTM4 channel 0 input capture source select
 *  0b00..FTM4_CH0 signal
 *  0b01..CMP0 output
 *  0b10..CMP1 output
 *  0b11..Reserved
 */
#define SIM_SOPT6_FTM4CH0SRC(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM4CH0SRC_SHIFT)) & SIM_SOPT6_FTM4CH0SRC_MASK)
#define SIM_SOPT6_FTM5CH0SRC_MASK                (0x300000U)
#define SIM_SOPT6_FTM5CH0SRC_SHIFT               (20U)
/*! FTM5CH0SRC - FTM5 channel 0 input capture source select
 *  0b00..FTM5_CH0 signal
 *  0b01..CMP0 output
 *  0b10..CMP1 output
 *  0b11..Reserved
 */
#define SIM_SOPT6_FTM5CH0SRC(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM5CH0SRC_SHIFT)) & SIM_SOPT6_FTM5CH0SRC_MASK)
#define SIM_SOPT6_FTM3CLKSEL_MASK                (0x3000000U)
#define SIM_SOPT6_FTM3CLKSEL_SHIFT               (24U)
/*! FTM3CLKSEL - FTM3 External Clock Pin Select
 *  0b00..FTM3 external clock driven by FTM_CLKIN0 pin
 *  0b01..FTM3 external clock driven by FTM_CLKIN1 pin
 *  0b10..FTM3 external clock driven by FTM_CLKIN2 pin
 *  0b11..Reserved
 */
#define SIM_SOPT6_FTM3CLKSEL(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM3CLKSEL_SHIFT)) & SIM_SOPT6_FTM3CLKSEL_MASK)
#define SIM_SOPT6_FTM4CLKSEL_MASK                (0xC000000U)
#define SIM_SOPT6_FTM4CLKSEL_SHIFT               (26U)
/*! FTM4CLKSEL - FTM4 External Clock Pin Select
 *  0b00..FTM4 external clock driven by FTM_CLKIN0 pin
 *  0b01..FTM4 external clock driven by FTM_CLKIN1 pin
 *  0b10..FTM4 external clock driven by FTM_CLKIN2 pin
 *  0b11..Reserved
 */
#define SIM_SOPT6_FTM4CLKSEL(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM4CLKSEL_SHIFT)) & SIM_SOPT6_FTM4CLKSEL_MASK)
#define SIM_SOPT6_FTM5CLKSEL_MASK                (0x30000000U)
#define SIM_SOPT6_FTM5CLKSEL_SHIFT               (28U)
/*! FTM5CLKSEL - FTM5 External Clock Pin Select
 *  0b00..FTM5 external clock driven by FTM_CLKIN0 pin
 *  0b01..FTM5 external clock driven by FTM_CLKIN1 pin
 *  0b10..FTM5 external clock driven by FTM_CLKIN2 pin
 *  0b11..Reserved
 */
#define SIM_SOPT6_FTM5CLKSEL(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT6_FTM5CLKSEL_SHIFT)) & SIM_SOPT6_FTM5CLKSEL_MASK)
/*! @} */

/*! @name SOPT7 - System Options Register 7 */
/*! @{ */
#define SIM_SOPT7_ADC0TRGSEL_MASK                (0xFU)
#define SIM_SOPT7_ADC0TRGSEL_SHIFT               (0U)
/*! ADC0TRGSEL - ADC0 Trigger Select
 *  0b0000..External trigger pin input (PDB_EXTRG0)
 *  0b0001..CMP0 output
 *  0b0010..CMP1 output
 *  0b0011..External trigger pin input (PDB_EXTRG1)
 *  0b0100..DMA channel 0 transfer last write complete
 *  0b0101..DMA channel 1 transfer last write complete
 *  0b0110..DMA channel 2 transfer last write complete
 *  0b0111..DMA channel 3 transfer last write complete
 *  0b1000..FTM0 intialtrig or external trig output
 *  0b1001..FTM1 intial trig or external trig output
 *  0b1010..FTM2 intial trig or external trig output
 *  0b1011..FTM3 intial trig or external trig output
 *  0b1100..FTM4 intial trig or external trig output
 *  0b1101..FTM5 intial trig or external trig output
 *  0b1110..LPTMR0 trigger
 *  0b1111..Reserved
 */
#define SIM_SOPT7_ADC0TRGSEL(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC0TRGSEL_SHIFT)) & SIM_SOPT7_ADC0TRGSEL_MASK)
#define SIM_SOPT7_ADC0PRETRGSEL_MASK             (0x10U)
#define SIM_SOPT7_ADC0PRETRGSEL_SHIFT            (4U)
/*! ADC0PRETRGSEL - ADC0 Pre-trigger Select
 *  0b0..Pre-trigger A for ADC0. Clearing this field will result in ADHWTSA=1 and ADHWTSB=0.
 *  0b1..Pre-trigger B for ADC0. Setting this bit will result in ADHWTSA=0 and ADHWTSB=1.
 */
#define SIM_SOPT7_ADC0PRETRGSEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC0PRETRGSEL_SHIFT)) & SIM_SOPT7_ADC0PRETRGSEL_MASK)
#define SIM_SOPT7_ADC0ALTTRGEN_MASK              (0xC0U)
#define SIM_SOPT7_ADC0ALTTRGEN_SHIFT             (6U)
/*! ADC0ALTTRGEN
 *  0b00..PDB0 CH0 triggers ADC0
 *  0b01..PDB1 CH0 triggers ADC0
 *  0b10..Alt trigger source as per ADC0TRGSEL
 *  0b11..PDB0 CH0 OR PDB1 CH0 trigger ADC0
 */
#define SIM_SOPT7_ADC0ALTTRGEN(x)                (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC0ALTTRGEN_SHIFT)) & SIM_SOPT7_ADC0ALTTRGEN_MASK)
#define SIM_SOPT7_ADC1TRGSEL_MASK                (0xF00U)
#define SIM_SOPT7_ADC1TRGSEL_SHIFT               (8U)
/*! ADC1TRGSEL - ADC1 Trigger Select
 *  0b0000..External trigger pin input (PDB_EXTRG0)
 *  0b0001..CMP0 output
 *  0b0010..CMP1 output
 *  0b0011..External trigger pin input (PDB_EXTRG1)
 *  0b0100..DMA channel 0 transfer last write complete
 *  0b0101..DMA channel 1 transfer last write complete
 *  0b0110..DMA channel 2 transfer last write complete
 *  0b0111..DMA channel 3 transfer last write complete
 *  0b1000..FTM0 intialtrig or external trig output
 *  0b1001..FTM1 intial trig or external trig output
 *  0b1010..FTM2 intial trig or external trig output
 *  0b1011..FTM3 intial trig or external trig output
 *  0b1100..FTM4 intial trig or external trig output
 *  0b1101..FTM5 intial trig or external trig output
 *  0b1110..LPTMR0 trigger
 *  0b1111..Reserved
 */
#define SIM_SOPT7_ADC1TRGSEL(x)                  (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC1TRGSEL_SHIFT)) & SIM_SOPT7_ADC1TRGSEL_MASK)
#define SIM_SOPT7_ADC1PRETRGSEL_MASK             (0x1000U)
#define SIM_SOPT7_ADC1PRETRGSEL_SHIFT            (12U)
/*! ADC1PRETRGSEL - ADC1 Pre-trigger Select
 *  0b0..Pre-trigger A for ADC1. Clearing this field will result in ADHWTSA=1 and ADHWTSB=0.
 *  0b1..Pre-trigger B for ADC1. Setting this bit will result in ADHWTSA=0 and ADHWTSB=1.
 */
#define SIM_SOPT7_ADC1PRETRGSEL(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC1PRETRGSEL_SHIFT)) & SIM_SOPT7_ADC1PRETRGSEL_MASK)
#define SIM_SOPT7_ADC1ALTTRGEN_MASK              (0xC000U)
#define SIM_SOPT7_ADC1ALTTRGEN_SHIFT             (14U)
/*! ADC1ALTTRGEN
 *  0b00..PDB0 CH1 triggers ADC1
 *  0b01..PDB1 CH1 triggers ADC1
 *  0b10..Alt trigger source ADC1TRGSEL
 *  0b11..PDB0 CH1 OR PDB1 CH1 trigger ADC1
 */
#define SIM_SOPT7_ADC1ALTTRGEN(x)                (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC1ALTTRGEN_SHIFT)) & SIM_SOPT7_ADC1ALTTRGEN_MASK)
#define SIM_SOPT7_ADC0ALTCLKSRC_MASK             (0x3000000U)
#define SIM_SOPT7_ADC0ALTCLKSRC_SHIFT            (24U)
/*! ADC0ALTCLKSRC - ADC0 ALT Clock Source Select
 *  0b00..OUTDIV5 output
 *  0b01..MCGIRCLK
 *  0b10..OSCERCLK
 *  0b11..Reserved
 */
#define SIM_SOPT7_ADC0ALTCLKSRC(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC0ALTCLKSRC_SHIFT)) & SIM_SOPT7_ADC0ALTCLKSRC_MASK)
#define SIM_SOPT7_ADC1ALTCLKSRC_MASK             (0xC000000U)
#define SIM_SOPT7_ADC1ALTCLKSRC_SHIFT            (26U)
/*! ADC1ALTCLKSRC - ADC1 ALT Clock Source Select
 *  0b00..OUTDIV5 output
 *  0b01..MCGIRCLK
 *  0b10..OSCERCLK
 *  0b11..Reserved
 */
#define SIM_SOPT7_ADC1ALTCLKSRC(x)               (((uint32_t)(((uint32_t)(x)) << SIM_SOPT7_ADC1ALTCLKSRC_SHIFT)) & SIM_SOPT7_ADC1ALTCLKSRC_MASK)
/*! @} */

/*! @name SOPT8 - System Options Register 8 */
/*! @{ */
#define SIM_SOPT8_FTM0SYNCBIT_MASK               (0x1U)
#define SIM_SOPT8_FTM0SYNCBIT_SHIFT              (0U)
/*! FTM0SYNCBIT - FlexTimer 0 Hardware Trigger 0 configure by software
 *  0b0..No effect to FTM0; this allow the hardware trigger options to function as expected. See SOPT4[FTM0TRG0SRC].
 *  0b1..If TRIG0 enabled, this refreshes the FTM0CNTIN and all buffered registers of the FTM0 (must write 0 first then write 1); this masks the hardware trigger.
 */
#define SIM_SOPT8_FTM0SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0SYNCBIT_SHIFT)) & SIM_SOPT8_FTM0SYNCBIT_MASK)
#define SIM_SOPT8_FTM1SYNCBIT_MASK               (0x2U)
#define SIM_SOPT8_FTM1SYNCBIT_SHIFT              (1U)
/*! FTM1SYNCBIT - FlexTimer 1 Hardware Trigger 0 configure by software
 *  0b0..No effect to FTM1; this allows the hardware trigger options to function as expected. See SOPT4[FTM1TRG0SRC].
 *  0b1..If TRIG0 enabled, this refreshes the FTM1CNTIN and all buffered registers of the FTM1 (must write 0 first then write 1); this masks the hardware trigger.
 */
#define SIM_SOPT8_FTM1SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM1SYNCBIT_SHIFT)) & SIM_SOPT8_FTM1SYNCBIT_MASK)
#define SIM_SOPT8_FTM2SYNCBIT_MASK               (0x4U)
#define SIM_SOPT8_FTM2SYNCBIT_SHIFT              (2U)
/*! FTM2SYNCBIT - FlexTimer 2 Hardware Trigger 0 configure by software
 *  0b0..No effect to FTM2; this allows the hardware trigger options to function as expected. See SOPT4[FTM2TRG0SRC].
 *  0b1..If TRIG0 is enabled, this refreshes the FTM2CNTIN and all buffered registers of the FTM2 (must write 0 first then write 1); this masks the hardware trigger.
 */
#define SIM_SOPT8_FTM2SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM2SYNCBIT_SHIFT)) & SIM_SOPT8_FTM2SYNCBIT_MASK)
#define SIM_SOPT8_FTM3SYNCBIT_MASK               (0x8U)
#define SIM_SOPT8_FTM3SYNCBIT_SHIFT              (3U)
/*! FTM3SYNCBIT - FlexTimer 3 Hardware Trigger 0 configure by software
 *  0b0..No effect to FTM3; this allows the hardware trigger options to function as expected. See SOPT6[FTM3TRG0SRC].
 *  0b1..If TRIG0 is enabled, this refreshes the FTM3CNTIN and allbuffered registers of the FTM3 (must write 0 first then write 1); this masks the hardware trigger.
 */
#define SIM_SOPT8_FTM3SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM3SYNCBIT_SHIFT)) & SIM_SOPT8_FTM3SYNCBIT_MASK)
#define SIM_SOPT8_FTM4SYNCBIT_MASK               (0x10U)
#define SIM_SOPT8_FTM4SYNCBIT_SHIFT              (4U)
/*! FTM4SYNCBIT - FlexTimer 4 Hardware Trigger 0 configure by software
 *  0b0..No effect to FTM4; this allows the hardware trigger options to function as expected. See SOPT6[FTM4TRG0SRC].
 *  0b1..If TRIG0 is enabled, this refreshes the FTM4CNTIN and allbuffered registers of the FTM4 (must write 0 first then write 1); this masks the hardware trigger.
 */
#define SIM_SOPT8_FTM4SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM4SYNCBIT_SHIFT)) & SIM_SOPT8_FTM4SYNCBIT_MASK)
#define SIM_SOPT8_FTM5SYNCBIT_MASK               (0x20U)
#define SIM_SOPT8_FTM5SYNCBIT_SHIFT              (5U)
/*! FTM5SYNCBIT - FlexTimer 5 Hardware Trigger 0 configure by software
 *  0b0..No effect on FTM5; this allows the hardware trigger options to function as expected. See SOPT6[FTM5TRG0SRC].
 *  0b1..If TRIG0 is enabled, this refreshes the FTM5CNTIN and allbuffered registers of the FTM5 (must write 0 first then write 1); this masks the hardware trigger.
 */
#define SIM_SOPT8_FTM5SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM5SYNCBIT_SHIFT)) & SIM_SOPT8_FTM5SYNCBIT_MASK)
#define SIM_SOPT8_CARRIER_SELECT0_MASK           (0x300U)
#define SIM_SOPT8_CARRIER_SELECT0_SHIFT          (8U)
/*! CARRIER_SELECT0 - Carrier frequency selection for FTM0/2 output channel
 *  0b00..FTM1_CH1 output provides the carrier signal for Timer Modulation mode
 *  0b01..LPTMR0 prescaler output provides the carrier signal for Timer Modulation mode
 *  0b10..FTM5_CH1 output provides the carrier signal for Timer Modulation mode
 *  0b11..Reserved
 */
#define SIM_SOPT8_CARRIER_SELECT0(x)             (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_CARRIER_SELECT0_SHIFT)) & SIM_SOPT8_CARRIER_SELECT0_MASK)
#define SIM_SOPT8_FTM0OCH0SRC_MASK               (0x10000U)
#define SIM_SOPT8_FTM0OCH0SRC_SHIFT              (16U)
/*! FTM0OCH0SRC - FTM0 channel 0 output PWM/OCMP mode source select
 *  0b0..FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP
 *  0b1..FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM0OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0OCH0SRC_SHIFT)) & SIM_SOPT8_FTM0OCH0SRC_MASK)
#define SIM_SOPT8_FTM0OCH1SRC_MASK               (0x20000U)
#define SIM_SOPT8_FTM0OCH1SRC_SHIFT              (17U)
/*! FTM0OCH1SRC - FTM0 channel 1 output PWM/OCMP mode source select
 *  0b0..FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP
 *  0b1..FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM0OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0OCH1SRC_SHIFT)) & SIM_SOPT8_FTM0OCH1SRC_MASK)
#define SIM_SOPT8_FTM0OCH2SRC_MASK               (0x40000U)
#define SIM_SOPT8_FTM0OCH2SRC_SHIFT              (18U)
/*! FTM0OCH2SRC - FTM0 channel 2 output PWM/OCMP mode source select
 *  0b0..FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP
 *  0b1..FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM0OCH2SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0OCH2SRC_SHIFT)) & SIM_SOPT8_FTM0OCH2SRC_MASK)
#define SIM_SOPT8_FTM0OCH3SRC_MASK               (0x80000U)
#define SIM_SOPT8_FTM0OCH3SRC_SHIFT              (19U)
/*! FTM0OCH3SRC - FTM0 channel 3 output PWM/OCMP mode source select
 *  0b0..FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP
 *  0b1..FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM0OCH3SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0OCH3SRC_SHIFT)) & SIM_SOPT8_FTM0OCH3SRC_MASK)
#define SIM_SOPT8_FTM0OCH4SRC_MASK               (0x100000U)
#define SIM_SOPT8_FTM0OCH4SRC_SHIFT              (20U)
/*! FTM0OCH4SRC - FTM0 channel 4 output PWM/OCMP mode source select
 *  0b0..FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP
 *  0b1..FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM0OCH4SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0OCH4SRC_SHIFT)) & SIM_SOPT8_FTM0OCH4SRC_MASK)
#define SIM_SOPT8_FTM0OCH5SRC_MASK               (0x200000U)
#define SIM_SOPT8_FTM0OCH5SRC_SHIFT              (21U)
/*! FTM0OCH5SRC - FTM0 channel 5 output PWM/OCMP mode source select
 *  0b0..FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP
 *  0b1..FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM0OCH5SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM0OCH5SRC_SHIFT)) & SIM_SOPT8_FTM0OCH5SRC_MASK)
#define SIM_SOPT8_FTM2OCH0SRC_MASK               (0x400000U)
#define SIM_SOPT8_FTM2OCH0SRC_SHIFT              (22U)
/*! FTM2OCH0SRC - FTM2 channel 0 output PWM/OCMP mode source select
 *  0b0..FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP
 *  0b1..FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM2OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM2OCH0SRC_SHIFT)) & SIM_SOPT8_FTM2OCH0SRC_MASK)
#define SIM_SOPT8_FTM2OCH1SRC_MASK               (0x800000U)
#define SIM_SOPT8_FTM2OCH1SRC_SHIFT              (23U)
/*! FTM2OCH1SRC - FTM2 channel 1 output PWM/OCMP mode source select
 *  0b0..FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP
 *  0b1..FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT0
 */
#define SIM_SOPT8_FTM2OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT8_FTM2OCH1SRC_SHIFT)) & SIM_SOPT8_FTM2OCH1SRC_MASK)
/*! @} */

